app/controllers/products_controller.rb

INSERT INTO "products" ("price", "name", "weight", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["price", 1000.0], ["name", "Iphone"], ["weight", 12.0], ["created_at", "2021-04-08 14:18:50.669500"], ["updated_at", "2021-04-08 14:18:50.669500"], ["description", "zbdsf"]]
---
  def create
    product = Product.create(products_params)

UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "https://monkeyshop.com.ua/content/uploads/images/iphone11-select-2019-family_geo_emea.jpg"], ["updated_at", "2021-04-25 18:46:30.170850"], ["id", 15]]
---
  def update
    if @product.update(products_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 14]]
---
  def destroy
    if @product.destroy.destroyed?

UPDATE "products" SET "votes_count" = COALESCE("votes_count", 0) + $1 WHERE "products"."id" = $2  [["votes_count", 1], ["id", 15]]
---
  def upvote
    @product.increment! :votes_count

SELECT "products".* FROM "products" WHERE (price > 50)
---
  def expensive
    @products = Product.where('price > 500')

SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY "products"."id" ASC LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def find_product
      @product = Product.where(id: params[:id]).first